Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/svd/PIC32CX1012BZ25032.svd
            <register>
               <name>ADCTRG2</name>
               <description>ADC Trigger Source 2 Register</description>
               <addressOffset>0x210</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TRGSRC4</name>
                     <description>Trigger Source for Conversion of ADC4 Module Select bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>TRGSRC4Select</name>
                        <enumeratedValue>
                           <name>EVSYS_47</name>
                           <description>ADC_TRIG_16</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_46</name>
                           <description>ADC_TRIG_15</description>
                           <value>0xf</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_45</name>
                           <description>ADC_TRIG_14</description>
                           <value>0xe</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_44</name>
                           <description>ADC_TRIG_13</description>
                           <value>0xd</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_43</name>
                           <description>ADC_TRIG_12</description>
                           <value>0xc</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_42</name>
                           <description>ADC_TRIG_11</description>
                           <value>0xb</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_41</name>
                           <description>ADC_TRIG_10</description>
                           <value>0xa</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_40</name>
                           <description>ADC_TRIG_9</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_39</name>
                           <description>ADC_TRIG_8</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_38</name>
                           <description>ADC_TRIG_7</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_37</name>
                           <description>ADC_TRIG_6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_36</name>
                           <description>ADC_TRIG_5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT0</name>
                           <description>INT0</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCAN_TRIG</name>
                           <description>Scan trigger</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW_LVL</name>
                           <description>Software level trigger</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW_EDGE</name>
                           <description>Software edge trigger</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Trigger</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGSRC5</name>
                     <description>Trigger Source for Conversion of ADC5 Module Select bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>TRGSRC5Select</name>
                        <enumeratedValue>
                           <name>EVSYS_47</name>
                           <description>ADC_TRIG_16</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_46</name>
                           <description>ADC_TRIG_15</description>
                           <value>0xf</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_45</name>
                           <description>ADC_TRIG_14</description>
                           <value>0xe</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_44</name>
                           <description>ADC_TRIG_13</description>
                           <value>0xd</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_43</name>
                           <description>ADC_TRIG_12</description>
                           <value>0xc</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_42</name>
                           <description>ADC_TRIG_11</description>
                           <value>0xb</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_41</name>
                           <description>ADC_TRIG_10</description>
                           <value>0xa</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_40</name>
                           <description>ADC_TRIG_9</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_39</name>
                           <description>ADC_TRIG_8</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_38</name>
                           <description>ADC_TRIG_7</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_37</name>
                           <description>ADC_TRIG_6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_36</name>
                           <description>ADC_TRIG_5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT0</name>
                           <description>INT0</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCAN_TRIG</name>
                           <description>Scan trigger</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW_LVL</name>
                           <description>Software level trigger</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW_EDGE</name>
                           <description>Software edge trigger</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Trigger</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCCMPCON1</name>
               <addressOffset>0x280</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IELOLO</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IELOHI</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IEHILO</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IEHIHI</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IEBTWN</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCMPED</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCMPIEN</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDCMP</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMPINID0</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>CVD_DATA</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCCMPCON2</name>
               <addressOffset>0x290</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IELOLO</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IELOHI</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IEHILO</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IEHIHI</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IEBTWN</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCMPED</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCMPGIEN</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDCMP</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AINID</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCBASE</name>
               <addressOffset>0x300</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADCBASE</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCDMASTAT</name>
               <addressOffset>0x310</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RAF0</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RAF_IEN0</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA_CNT_EN</name>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RBF0</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WR_OVF_ERR</name>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RBF_IEN0</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAEN</name>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCCNTB</name>
               <addressOffset>0x320</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADCCNTB</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCDMAB</name>
               <addressOffset>0x330</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDMAB</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCTRGSNS</name>
               <addressOffset>0x340</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LVL0</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVL1</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVL2</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVL3</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVL4</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVL5</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVL6</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVL7</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCANCON</name>
               <addressOffset>0x400</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ANEN0</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANEN7</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKRDY0</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKRDY7</name>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKIEN0</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKIEN7</name>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPCLKCNT</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADC7CFG</name>
               <addressOffset>0x670</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADC7CFG</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCSVCON</name>
               <addressOffset>0x680</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SVSEL</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>SVCLKEN</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADSVEN</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCSYSCFG0</name>
               <addressOffset>0x700</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AN0</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AN1</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AN2</name>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AN3</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AN4</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AN5</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AN6</name>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AN7</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AN8</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AN9</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AN10</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AN11</name>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCDATA0</name>
               <addressOffset>0xa00</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
