Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ25/svd/PIC32CX1012BZ25032.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>BLE</name>
         <version>U66671.0</version>
         <description>BLE</description>
         <groupName>BLE</groupName>
         <prependToName>BLE_</prependToName>
         <baseAddress>0x41012000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x4BC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>BT_INT0</name>
            <value>31</value>
         </interrupt>
         <interrupt>
            <name>BT_INT1</name>
            <value>32</value>
         </interrupt>
         <interrupt>
            <name>CLKI_WAKEUP_NMI</name>
            <value>37</value>
         </interrupt>
         <interrupt>
            <name>BT_LC</name>
            <value>38</value>
         </interrupt>
         <interrupt>
            <name>BT_RC</name>
            <value>39</value>
         </interrupt>
         <registers>
            <register>
               <name>DPLL_RG1</name>
               <addressOffset>0x04B8</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>DPLL_RG1BITS</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DPLL_RG2</name>
               <addressOffset>0x04BA</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>DPLL_RG2BITS</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>BTZBSYS</name>
         <version>U99981.0.0</version>
         <description>BT ZB Subsystem</description>
         <groupName>BTZBSYS</groupName>
         <prependToName>BTZBSYS_</prependToName>
         <baseAddress>0x41014000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x28</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SUBSYS_CNTRL_REG0</name>
               <description>SUBSYS_CNTRL_REG0</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>bt_en_main_clk</name>
                     <description>bt_en_main_clk</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>bt_reset_by_fw</name>
                     <description>bt_reset_by_fw</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>bt_hw_rc_re_cal</name>
                     <description>bt_hw_rc_re_cal</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>bt_sfr_wakeup_bit</name>
                     <description>bt_sfr_wakeup_bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>bt_pdc_ov</name>
                     <description>bt_pdc_ov</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ant_div_sel_2_iom_en</name>
                     <description>ant_div_sel_2_iom_en</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ant_div_sel_1_iom_en</name>
                     <description>ant_div_sel_1_iom_en</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_en_main_clk</name>
                     <description>zb_en_main_clk</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_reset_by_fw</name>
                     <description>zb_reset_by_fw</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_soft_reset_in</name>
                     <description>zb_soft_reset_in</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_slp_ctrl</name>
                     <description>zb_slp_ctrl</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUBSYS_CNTRL_REG1</name>
               <description>SUBSYS_CNTRL_REG1</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x0000F000</resetValue>
               <fields>
                  <field>
                     <name>clk_lp_req</name>
                     <description>clk_lp_req</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>invert_btadc_clk</name>
                     <description>invert_btadc_clk</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_bt_bar_ovrd_val</name>
                     <description>zb_bt_bar_ovrd_val</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_bt_bar_ovrd_en</name>
                     <description>zb_bt_bar_ovrd_en</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>lna_on_iom_en</name>
                     <description>lna_on_iom_en</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>pa_on_iom_en</name>
                     <description>pa_on_iom_en</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>tr_sw_n_iom_en</name>
                     <description>tr_sw_n_iom_en</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>tr_sw_iom_en</name>
                     <description>tr_sw_iom_en</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>subsys_xtal_ready_delay</name>
                     <description>subsys_xtal_ready_delay</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>subsys_bypass_pll_lock</name>
                     <description>subsys_bypass_pll_lock</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>subsys_bypass_xtal_ready</name>
                     <description>subsys_bypass_xtal_ready</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ssubsys_clk_div_sel</name>
                     <description>subsys_clk_div_sel</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>subsys_clk_src_sel</name>
                     <description>subsys_clk_src_sel</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>subsys_dbg_bus_sel</name>
                     <description>subsys_dbg_bus_sel</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>subsys_dbg_bus_sel_top</name>
                     <description>subsys_dbg_bus_sel_top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUBSYS_STATUS_REG0</name>
               <description>SUBSYS_STATUS_REG0</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>bt_rf_idle</name>
                     <description>bt_rf_idle</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>bt_low_power_mode</name>
                     <description>bt_low_power_mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>radio_idle_zb</name>
                     <description>radio_idle_zb</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_deep_sleep_mode</name>
                     <description>zb_deep_sleep_mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>zb_sleep_mode</name>
                     <description>zb_sleep_mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUBSYS_STATUS_REG1</name>
               <description>SUBSYS_STATUS_REG1</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>clk_lp_ready</name>
                     <description>clk_lp_ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLL_locked</name>
                     <description>PLL_locked</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>XTAL_ready</name>
                     <description>XTAL_ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>pll_lock_out</name>
                     <description>pll_lock_out</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>xtal_ready_out</name>
                     <description>xtal_ready_out</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
